<a href="https://colab.research.google.com/github/shruthi-jay/pandas/blob/main/pytho.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### CSCA 562  -  Python Programming for Data Analytics

### **REG NO  :  20352049**

NAME    :      SRUTHI O T 

DATE    :      21-6-2021 

Github link  :   https://github.com/shruthi-jay/pandas/blob/main/pytho.ipynb



---

                                                  1. CREATING DATAFRAME  USING DIFFERENT METHODS

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.There are many ways of creating a dataframe. Few ways to create a dataframe are :

1. Create an empty DataFrame

    a) without any column name or indices and then appending columns one by one to it.

In [95]:
# importing the pandas library  
import pandas as pd  
df = pd.DataFrame()  
print (df)  
df['Pokemon'] = ['Charmander', 'Pikachu', 'Squirtle']
df['Type'] = ['Fire','Electric','Water']
df['Hp'] = [58, 35, 44]
df

Empty DataFrame
Columns: []
Index: []

      Pokemon      Type  Hp
0  Charmander      Fire  58
1     Pikachu  Electric  35
2    Squirtle     Water  44

    b) with columns name only  and then appending rows one by one to it using append() method

In [2]:
import pandas as pd
# create an Empty DataFrame object With column names only
df = pd.DataFrame(columns = ['Nam', 'Type', 'Total'])
print(df)
# append rows to an empty DataFrame
df = df.append({'Nam':'Bulbasaur','Type':'Grass','Total':318},ignore_index = True)
df = df.append({'Nam':'Ivysaur','Type':'Grass','Total':405},ignore_index = True)
df = df.append({'Nam':' Venusaur','Type':'Grass','Total':525},ignore_index = True)
df

Empty DataFrame
Columns: [Nam, Type, Total]
Index: []

         Nam   Type Total
0  Bulbasaur  Grass   318
1    Ivysaur  Grass   405
2   Venusaur  Grass   525

    c) with a column name and indices and then appending rows one by one to it using loc[] method

In [3]:
import pandas as pd
# create an Empty DataFrame object With column names and indices 
df = pd.DataFrame(columns = ['Hero', 'Agility', 'Accelerated Healing'], index = ['a', 'b', 'c'])
print("Empty DataFrame\n", df)
# adding rows to an empty  dataframe at existing index
df.loc['a'] = [' 3-D Man','True','False']
df.loc['b'] = ['A-Bomb','False','True']
df.loc['c'] = ['Abe Sapien','True','True']
df

Empty DataFrame
   Hero Agility Accelerated Healing
a  NaN     NaN                 NaN
b  NaN     NaN                 NaN
c  NaN     NaN                 NaN

         Hero Agility Accelerated Healing
a     3-D Man    True               False
b      A-Bomb   False                True
c  Abe Sapien    True                True

2) Create DataFrame using List

    a) with index and column names.

In [4]:
import pandas as pd
# list of strings
lst = ['Snow White and the Seven Dwarfs','Pinocchio','Fantasia']
# Calling DataFrame constructor on list  with indices and columns specified
df = pd.DataFrame(lst, index =['1937-12-21', '1940-02-09',' 1940-11-13'],columns =['Movie'])
df

                                       Movie
1937-12-21   Snow White and the Seven Dwarfs
1940-02-09                         Pinocchio
 1940-11-13                         Fantasia

    b) using multi-dimensional list

In [5]:
import pandas as pd 
lst = [['The Light Between Oceans','Drama'], ['Queen of Katwe','Drama'],
       ['Doctor Strange','Adventure'], ['Moana','Adventure']]
df = pd.DataFrame(lst, columns =['Movie', 'Type'])
df

                      Movie       Type
0  The Light Between Oceans      Drama
1            Queen of Katwe      Drama
2            Doctor Strange  Adventure
3                     Moana  Adventure

3) Create Dataframe from Numpy Array

In [6]:
import pandas as pd
import numpy as np
# creating the Numpy array
array = np.array([['Earth','Documentary'], ['Up','Adventure'],
                  ['The Proposal','Romantic Comedy'], ['Toy Story 3D Double Feature','Adventure'], 
                  ['The Princess and the Frog','Adventure']])
# creating a list of index names
index_values = ['A', 'B', 'C', 'D', 'E']
# creating a list of column names
column_values = ['Movie', 'Age']
# creating the dataframe
df = pd.DataFrame(data = array,index = index_values, columns = column_values)
df

                         Movie              Age
A                        Earth      Documentary
B                           Up        Adventure
C                 The Proposal  Romantic Comedy
D  Toy Story 3D Double Feature        Adventure
E    The Princess and the Frog        Adventure

4) Create data frame using dictionary

    a) using default Constructor of pandas-Dataframe class

In [7]:
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'])
df

                              Title Format  Episode
a  Fullmetal Alchemist: Brotherhood     Tv       64
b                         your name  Movie        1
c                    A Silent Voice  Movie        1

    b) from Dictionary with required columns only

In [8]:
import pandas as pd
# dictionary with list object in values
details = {
    'Title' : ['Fullmetal Alchemist: Brotherhood', 'your name', 'A Silent Voice'],
    'Format' : ['Tv','Movie','Movie'],
    'Episode' : [64,1,1],
}
# creating a Dataframe object 
df = pd.DataFrame(details,index = ['a', 'b', 'c'],columns = ['Title', 'Format'])
df

                              Title Format
a  Fullmetal Alchemist: Brotherhood     Tv
b                         your name  Movie
c                    A Silent Voice  Movie

    c) from dictionary with key and simple value

In [9]:
import pandas as pd
# dictionary
details = {
    'Inception' : 2010,
    'Avengers: Infinity War' : 2018,
    'Back to the Future' : 1985,
    'Spider-Man: Into the Spider-Verse' :2018
    }
#creating a Dataframe object from a list of tuples of key, value pair
df = pd.DataFrame(list(details.items()))  
df

                                   0     1
0                          Inception  2010
1             Avengers: Infinity War  2018
2                 Back to the Future  1985
3  Spider-Man: Into the Spider-Verse  2018

    d) from nested Dictionary.

In [10]:
import pandas as pd
# dictionary with dictionary object in values i.e. nested dictionary
details = { 
    0 : {
        'Title' :'Like Stars on Earth',
        'Year' : 2007,
        'IMDb rating' :8.4
        },
    1 : {
       'Title' :'A Silent Voice',
        'Year' :2016,
        'IMDb rating' :8.2
        },
    2 : {
         'Title' :'Bill Burr: Im Sorry You Feel That Way',
        'Year' :2014 ,
        'IMDb rating' :8.4
        },
    3:  {
        'Title':'The Pianist'   ,
         'Year' :2002   ,
         'IMDb rating' : 8.5
        },
    4:  {
        'Title':'Austin Powers: International Man of Mystery'    ,
         'Year' : 1997   ,
         'IMDb rating' : 7
        },
    5:  {
        'Title':'Paper Tiger',
         'Year' :2019,
         'IMDb rating' : 8.2
         },
    6:  {
        'Title':'Avengers: Infinity War',
         'Year' : 2018   ,
         'IMDb rating' : 8.5
    },
}
  
# creating a Dataframe object from nested dictionaryin which inside dictionary key is act as index valueand column value is 0, 1, 2...
df = pd.DataFrame(details)
# swap the columns with indexes
df = df.transpose()
df

                                         Title  Year IMDb rating
0                          Like Stars on Earth  2007         8.4
1                               A Silent Voice  2016         8.2
2        Bill Burr: Im Sorry You Feel That Way  2014         8.4
3                                  The Pianist  2002         8.5
4  Austin Powers: International Man of Mystery  1997           7
5                                  Paper Tiger  2019         8.2
6                       Avengers: Infinity War  2018         8.5

 5)  copying an existing dataframe

In [12]:
df1 = df.head(3).copy()
df1

                                   Title  Year IMDb rating
0                    Like Stars on Earth  2007         8.4
1                         A Silent Voice  2016         8.2
2  Bill Burr: Im Sorry You Feel That Way  2014         8.4



---

                                                   2.  CREATE DATAFRAME FROM CSV FILE AND SAVE AS CSV FILE

Dataframe can be created from csv file using any of the following ways,

    a) Load data from local drive

In [13]:
import pandas as pd

from google.colab import files
uploaded = files.upload()

Saving superheroes_power_matrix.csv to superheroes_power_matrix.csv

In [16]:
import io
superheroes_df = pd.read_csv(io.BytesIO(uploaded['superheroes_power_matrix.csv']))
superheroes_df.head(2)

      Name  Agility  ...  Omnipresent  Omniscient
0  3-D Man     True  ...        False       False
1   A-Bomb    False  ...        False       False

[2 rows x 168 columns]

    b) From Github

We can easily construct a python pandas dataframe from a csv file using pandas.read_csv().

In [17]:
path='https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv'
pokemon_df = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, usecols = ['Name','Type 1','Attack','Defense','Speed'])
pokemon_df.head(7)

                    Name Type 1  Attack  Defense  Speed
0              Bulbasaur  Grass      49       49     45
1                Ivysaur  Grass      62       63     60
2               Venusaur  Grass      82       83     80
3  VenusaurMega Venusaur  Grass     100      123     80
4             Charmander   Fire      52       43     65
5             Charmeleon   Fire      64       58     80
6              Charizard   Fire      84       78    100

    3) Mount from drive

In [18]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [19]:
import pandas as pd
df=pd.read_csv("/content/drive/MyDrive/disney_movies.csv")
df.describe

<bound method NDFrame.describe of                          movie_title  ... inflation_adjusted_gross
0    Snow White and the Seven Dwarfs  ...               5228953251
1                          Pinocchio  ...               2188229052
2                           Fantasia  ...               2187090808
3                  Song of the South  ...               1078510579
4                         Cinderella  ...                920608730
..                               ...  ...                      ...
574         The Light Between Oceans  ...                 12545979
575                   Queen of Katwe  ...                  8874389
576                   Doctor Strange  ...                232532923
577                            Moana  ...                246082029
578     Rogue One: A Star Wars Story  ...                529483936

[579 rows x 6 columns]>

2) Save Dataframe as CSV file using to_csv() method

In [20]:
data = {'Name':['Brad Pitt','Christopher Walken','Daniel Day-Lewis','Dustin Hoffman'],
        'Oscar':[1,1,3,2],
        'BAFTA':[1,1,4,4]}
df = pd.DataFrame(data)
df.to_csv('my_dataset.csv')



---

                                                       3. GROUP BY OPERATIONS IN DATAFRAME

Pandas dataframe.groupby() function is used to split the data into groups based on some criteria. pandas objects can be split on any of their axes.Some of the attributes and methods used to access DataFrameGroupBy are

  1)   Splitting to groups

In [21]:
import pandas as pd 
df = pd.read_csv('https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv')
gk = df.groupby('Type 1')
# Let's print the first entries in all the groups formed.
gk.first()

            #                     Name    Type 2  ...  Speed  Generation  Legendary
Type 1                                            ...
Bug        10                 Caterpie    Flying  ...     45           1      False
Dark      197                  Umbreon    Flying  ...     65           2      False
Dragon    147                  Dratini    Flying  ...     50           1      False
Electric   25                  Pikachu     Steel  ...     90           1      False
Fairy      35                 Clefairy    Flying  ...     35           1      False
Fighting   56                   Mankey   Psychic  ...     70           1      False
Fire        4               Charmander    Flying  ...     65           1      False
Flying    641  TornadusIncarnate Forme    Dragon  ...    111           5       True
Ghost      92                   Gastly    Poison  ...     80           1      False
Grass       1                Bulbasaur    Poison  ...     45           1      False
Ground     27                Sandshrew      Rock  ...     40           1      False
Ice       124                     Jynx   Psychic  ...     95           1      False
Normal     16                   Pidgey    Flying  ...     56           1      False
Poison     23                    Ekans    Ground  ...     55           1      False
Psychic    63                     Abra     Fairy  ...     90           1      False
Rock       74                  Geodude    Ground  ...     20           1      False
Steel     208                  Steelix    Ground  ...     30           2      False
Water       7                 Squirtle  Fighting  ...     43           1      False

[18 rows x 12 columns]

In [22]:
gk.last()

            #                   Name    Type 2  ...  Speed  Generation  Legendary
Type 1                                          ...
Bug       666               Vivillon    Flying  ...     89           6      False
Dark      717                Yveltal    Flying  ...     99           6       True
Dragon    718       Zygarde50% Forme    Ground  ...     95           6       True
Electric  702                Dedenne     Fairy  ...    101           6      False
Fairy     716                Xerneas    Flying  ...     99           6       True
Fighting  701               Hawlucha    Flying  ...    118           6      False
Fire      721              Volcanion     Water  ...     70           6       True
Flying    715                Noivern    Dragon  ...    123           6      False
Ghost     711    GourgeistSuper Size     Grass  ...     54           6      False
Grass     673                 Gogoat  Fighting  ...     68           6      False
Ground    645  LandorusTherian Forme    Flying  ...     91           5       True
Ice       713                Avalugg     Ghost  ...     28           6      False
Normal    676                Furfrou    Flying  ...    102           6      False
Poison    691               Dragalge    Dragon  ...     44           6      False
Psychic   720     HoopaHoopa Unbound      Dark  ...     80           6       True
Rock      719    DiancieMega Diancie     Fairy  ...    110           6       True
Steel     707                 Klefki     Fairy  ...     75           6      False
Water     693              Clawitzer      Dark  ...     59           6      False

[18 rows x 12 columns]

 2) Select a Group

In [23]:
gk.get_group('Water').head(5)

     #                     Name Type 2  ...  Speed  Generation  Legendary
9    7                 Squirtle    NaN  ...     43           1      False
10   8                Wartortle    NaN  ...     58           1      False
11   9                Blastoise    NaN  ...     78           1      False
12   9  BlastoiseMega Blastoise    NaN  ...     78           1      False
59  54                  Psyduck    NaN  ...     55           1      False

[5 rows x 12 columns]

3) ngroups

it returns number of groups

In [24]:
gk.ngroups

18

4)  groups

it returns groupwise row number

In [25]:
gk.groups

{'Bug': [13, 14, 15, 16, 17, 18, 19, 51, 52, 53, 54, 132, 136, 137, 179, 180, 181, 182, 208, 219, 220, 228, 229, 230, 231, 232, 288, 289, 290, 291, 292, 307, 308, 314, 315, 316, 342, 343, 446, 447, 457, 458, 459, 460, 461, 462, 463, 520, 600, 601, 602, 603, 604, 605, 618, 619, 649, 650, 656, 657, 677, 678, 693, 697, 698, 717, 732, 733, 734], 'Dark': [212, 213, 233, 246, 247, 248, 284, 285, 326, 327, 392, 393, 478, 512, 549, 568, 569, 620, 621, 631, 632, 685, 686, 690, 691, 694, 695, 696, 756, 757, 793], 'Dragon': [159, 160, 161, 365, 366, 406, 407, 408, 409, 417, 418, 419, 420, 425, 426, 491, 492, 493, 494, 671, 672, 673, 682, 706, 707, 710, 711, 712, 774, 775, 776, 794], 'Electric': [30, 31, 88, 89, 108, 109, 134, 146, 157, 186, 193, 194, 195, 196, 258, 262, 337, 338, 339, 340, 341, 448, 449, 450, 464, 513, 517, 531, 532, 533, 534, 535, 536, 581, 582, 648, 663, 664, 665, 704, 705, 764, 765, 772], 'Fairy': [40, 41, 187, 189, 190, 225, 226, 519, 737, 738, 739, 752, 753, 754, 755, 770, 792], 'Fighting': [61, 62, 72, 73, 74, 114, 115, 255, 256, 320, 321, 334, 335, 336, 496, 497, 498, 592, 593, 594, 598, 599, 680, 681, 742, 743, 771], 'Fire': [4, 5, 6, 7, 8, 42, 43, 63, 64, 83, 84, 135, 147, 158, 169, 170, 171, 236, 237, 259, 263, 270, 276, 277, 278, 279, 352, 353, 354, 355, 435, 436, 437, 518, 542, 557, 558, 559, 572, 573, 614, 615, 616, 692, 721, 722, 723, 730, 731, 735, 736, 799], 'Flying': [702, 703, 790, 791], 'Ghost': [99, 100, 101, 102, 215, 385, 386, 387, 388, 389, 472, 473, 477, 490, 529, 544, 545, 623, 624, 668, 669, 670, 778, 779, 780, 781, 782, 783, 784, 785, 786, 787], 'Grass': [0, 1, 2, 3, 48, 49, 50, 75, 76, 77, 110, 111, 122, 166, 167, 168, 197, 202, 203, 204, 206, 207, 272, 273, 274, 275, 296, 297, 298, 309, 310, 344, 362, 363, 390, 432, 433, 434, 451, 452, 467, 468, 505, 509, 510, 511, 516, 521, 550, 551, 554, 555, 556, 570, 571, 606, 607, 608, 609, 617, 651, 652, 658, 659, 701, 718, 719, 720, 740, 741], 'Ground': [32, 33, 55, 56, 112, 113, 119, 120, 222, 250, 251, 359, 360, 361, 375, 376, 423, 424, 499, 500, 515, 523, 588, 589, 611, 612, 613, 679, 683, 684, 708, 709], 'Ice': [133, 156, 238, 239, 243, 257, 395, 396, 397, 398, 399, 400, 415, 522, 524, 530, 643, 644, 645, 674, 675, 676, 788, 789], 'Normal': [20, 21, 22, 23, 24, 25, 26, 27, 44, 45, 57, 58, 90, 91, 92, 116, 121, 123, 124, 138, 143, 144, 148, 155, 175, 176, 177, 178, 188, 205, 218, 221, 234, 235, 252, 253, 254, 260, 261, 286, 287, 299, 300, 311, 312, 313, 317, 318, 319, 322, 324, 325, 358, 364, 367, 383, 384, 441, 442, 443, 444, 445, 471, 474, 475, 476, 479, 480, 488, 489, 495, 514, 525, 543, 552, 563, 564, 565, 566, 567, 578, 579, 580, 590, 591, 633, 634, 646, 647, 687, 688, 689, 715, 716, 727, 728, 729, 744], 'Poison': [28, 29, 34, 35, 36, 37, 38, 39, 46, 47, 95, 96, 117, 118, 183, 345, 346, 368, 482, 483, 501, 502, 503, 504, 629, 630, 760, 761], 'Psychic': [68, 69, 70, 71, 104, 105, 131, 162, 163, 164, 165, 191, 192, 211, 216, 217, 269, 271, 303, 304, 305, 306, 356, 357, 391, 394, 428, 429, 430, 431, 481, 487, 526, 527, 537, 538, 539, 546, 553, 576, 577, 586, 587, 622, 635, 636, 637, 638, 639, 640, 666, 667, 745, 746, 747, 797, 798], 'Rock': [80, 81, 82, 103, 149, 150, 151, 152, 153, 154, 200, 265, 266, 267, 268, 323, 369, 370, 377, 378, 379, 380, 414, 453, 454, 455, 456, 486, 528, 583, 584, 585, 627, 628, 700, 758, 759, 766, 767, 768, 769, 773, 795, 796], 'Steel': [223, 224, 245, 328, 329, 330, 331, 332, 333, 410, 411, 412, 413, 416, 427, 484, 485, 540, 660, 661, 662, 699, 748, 749, 750, 751, 777], 'Water': [9, 10, 11, 12, 59, 60, 65, 66, 67, 78, 79, 85, 86, 87, 93, 94, 97, 98, 106, 107, 125, 126, 127, 128, 129, 130, 139, 140, 141, 142, 145, 172, 173, 174, 184, 185, 198, 199, 201, 209, 210, 214, 227, 240, 241, 242, 244, 249, 264, 280, 281, 282, 283, 293, 294, 295, 301, 302, 347, 348, 349, 350, 351, 371, 372, 373, 374, 381, 382, 401, 402, 403, 404, 405, 421, 422, 438, 439, 440, 465, 466, 469, 470, 506, 507, 508, 541, 547, 548, 560, 561, 562, 574, 575, 595, 596, 597, 610, 625, 626, ...]}



---

5) size()

it display group sizes

In [26]:
gk.size()

Type 1
Bug          69
Dark         31
Dragon       32
Electric     44
Fairy        17
Fighting     27
Fire         52
Flying        4
Ghost        32
Grass        70
Ground       32
Ice          24
Normal       98
Poison       28
Psychic      57
Rock         44
Steel        27
Water       112
dtype: int64

                                                         4.  COMBINING AND MERGING DATASETS

a) Concatenating DataFrame

    1) using concat() only

In [27]:
#to concat a dataframe, we use .concat() function .this function concat a dataframe and returns a new dataframe.
import pandas as pd 
data1 = {'Movie':['Ice Princess', 'The Princess Diaries', 'Monsters, Inc.', 'The Jungle Book 2'], 
        'Year':[2005, 2001, 2001, 2003], 
        'Genre':['Comedy','Comedy', 'Adventure', 'Adventure']} 
   
# Define dictionary 
data2 = {'Movie':['Monsters University', 'Frozen', 'Thor: The Dark World', 'Into the Woods'], 
        'Year':[2013,2013, 2013,2014], 
        'Genre':['Adventure', 'Adventure', 'Adventure', 'Musical']} 

 
# Convert the dictionarys into DataFrames  
df1= pd.DataFrame(data1,index=[0, 1, 2, 3])
df2 = pd.DataFrame(data2, index=[4, 5, 6, 7])
frames = [df1, df2]
final_1 = pd.concat(frames)
final_1

                  Movie  Year      Genre
0          Ice Princess  2005     Comedy
1  The Princess Diaries  2001     Comedy
2        Monsters, Inc.  2001  Adventure
3     The Jungle Book 2  2003  Adventure
4   Monsters University  2013  Adventure
5                Frozen  2013  Adventure
6  Thor: The Dark World  2013  Adventure
7        Into the Woods  2014    Musical

    2)  Setting axis along with concat() to get intersection of dataframe

In [28]:
# set axes join = inner   to get the intersection of dataframe
data3 = {'Movie':['Monsters, Inc.', 'The Jungle Book 2', 'Thor: The Dark World', 'Into the Woods'], 
        'Year':[2001, 2003, 2013,2014], 
        'Genre':['Adventure', 'Adventure', 'Adventure', 'Musical']} 
df3 = pd.DataFrame(data3,index=[2, 3, 6, 7]) 
#set axes join = inner for intersection of dataframe
final_2 = pd.concat([df1, df3], axis=1, join='inner')
final_2

               Movie  Year      Genre              Movie  Year      Genre
2     Monsters, Inc.  2001  Adventure     Monsters, Inc.  2001  Adventure
3  The Jungle Book 2  2003  Adventure  The Jungle Book 2  2003  Adventure

b) Merging DataFrame

Merging two dataset can be done in dataframes with common column name
and  with different column name

    1)  Merge Two DataFrames on a Key

In [29]:
# import the pandas library
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu'],
   'type':['Water','Fire','Poison','Bug','Electric']})
pd.merge(left,right,on='id')

   id     Name_x    type_x    Name_y    type_y
0   1  Bulbasaur     Grass    Lapras     Water
1   2  Wartortle     Water    Magmar      Fire
2   3    Flareon      Fire     Arbok    Poison
3   4     Kakuna       Bug  Beedrill       Bug
4   5    Pikachu  Electric    Raichu  Electric

    2)  Merge Two DataFrames on Multiple Keys

In [30]:
import pandas as pd
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu'],
   'type':['Water','Fire','Poison','Bug','Electric']})
pd.merge(left,right,on=['id','type'])

   id   Name_x      type    Name_y
0   4   Kakuna       Bug  Beedrill
1   5  Pikachu  Electric    Raichu

    3)  Merge Using 'how' Argument

In [31]:
#left join
pd.merge(left, right, on='type', how='left')

   id_x     Name_x      type  id_y    Name_y
0     1  Bulbasaur     Grass   NaN       NaN
1     2  Wartortle     Water   1.0    Lapras
2     3    Flareon      Fire   2.0    Magmar
3     4     Kakuna       Bug   4.0  Beedrill
4     5    Pikachu  Electric   5.0    Raichu

In [32]:
#right join
pd.merge(left, right, on='type', how='right')

   id_x     Name_x      type  id_y    Name_y
0   2.0  Wartortle     Water     1    Lapras
1   3.0    Flareon      Fire     2    Magmar
2   NaN        NaN    Poison     3     Arbok
3   4.0     Kakuna       Bug     4  Beedrill
4   5.0    Pikachu  Electric     5    Raichu

In [33]:
#outer join
pd.merge(left, right, on='type', how='outer')

   id_x     Name_x      type  id_y    Name_y
0   1.0  Bulbasaur     Grass   NaN       NaN
1   2.0  Wartortle     Water   1.0    Lapras
2   3.0    Flareon      Fire   2.0    Magmar
3   4.0     Kakuna       Bug   4.0  Beedrill
4   5.0    Pikachu  Electric   5.0    Raichu
5   NaN        NaN    Poison   3.0     Arbok

In [34]:
#inner join
pd.merge(left, right, on='type', how='inner')

   id_x     Name_x      type  id_y    Name_y
0     2  Wartortle     Water     1    Lapras
1     3    Flareon      Fire     2    Magmar
2     4     Kakuna       Bug     4  Beedrill
3     5    Pikachu  Electric     5    Raichu

3)  Join
  
   Both join and merge can be used to combines two dataframes but the join method combines two dataframes on the basis of their indexes whereas the merge method is more versatile and allows us to specify columns beside the index to join on for both dataframes.

In [36]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu'],
   'type':['Water','Fire','Poison','Bug','Electric']})
left.join(right,lsuffix = '_l',rsuffix = '_r')

   id_l     Name_l    type_l  id_r    Name_r    type_r
0     1  Bulbasaur     Grass     1    Lapras     Water
1     2  Wartortle     Water     2    Magmar      Fire
2     3    Flareon      Fire     3     Arbok    Poison
3     4     Kakuna       Bug     4  Beedrill       Bug
4     5    Pikachu  Electric     5    Raichu  Electric



---

                                                         5. TYPES  OF INDEXING IN DATA FRAME

Indexing in pandas means simply selecting particular rows and columns of data from a DataFrame.Indexing can also be known as Subset Selection.

    1)  Indexing a Dataframe using indexing operator [] :

In [37]:
# retrieving columns by indexing operator
first = pokemon_df["Name"]
first.head(7)

0                Bulbasaur
1                  Ivysaur
2                 Venusaur
3    VenusaurMega Venusaur
4               Charmander
5               Charmeleon
6                Charizard
Name: Name, dtype: object

In [38]:
#In order to select multiple columns, we have to pass a list of columns in an indexing operator.
first = pokemon_df[["Attack", "Speed"]]
first.sample(6)

     Attack  Speed
486      80     10
263     115    100
712     120     95
477      60    105
7       130    100
88       35     45

    2) indexing a DataFrame using .loc[ ] :

In [47]:
#In order to select a single row using .loc[], we put a single row label in a .loc function.
path='https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv'
pokemon_d = pd.read_csv(path,sep = ',', header = 'infer',index_col ="Name", usecols = ['Name','Type 1','Attack','Defense','Speed'])
first = pokemon_d.loc["Pikachu"]
second = pokemon_d.loc["Rattata"]
print(first,"\n-----------------------------\n",second)

Type 1     Electric
Attack           55
Defense          40
Speed            90
Name: Pikachu, dtype: object
-----------------------------
 Type 1     Normal
Attack         56
Defense        35
Speed          72
Name: Rattata, dtype: object

In [48]:
#In order to select multiple rows, we put all the row labels in a list and pass that to .loc function.
# retrieving multiple rows by loc method
first = pokemon_d.loc[["Squirtle", "Kakuna"]]
print(first)

         Type 1  Attack  Defense  Speed
Name
Squirtle  Water      48       65     43
Kakuna      Bug      25       50     35

In [46]:
# retrieving all rows and some columns by loc method
first = pokemon_df.loc[:, ["Name", "Attack"]]
first.head(5)

                    Name  Attack
0              Bulbasaur      49
1                Ivysaur      62
2               Venusaur      82
3  VenusaurMega Venusaur     100
4             Charmander      52

    3)  Indexing a DataFrame using .iloc[ ] :

In [49]:
#Selecting a single row
now = pokemon_df.iloc[3] 
print(now)

Name       VenusaurMega Venusaur
Type 1                     Grass
Attack                       100
Defense                      123
Speed                         80
Name: 3, dtype: object

In [50]:
#Selecting multiple 
now= pokemon_df.iloc [[3, 5, 7]]
now

                        Name Type 1  Attack  Defense  Speed
3      VenusaurMega Venusaur  Grass     100      123     80
5                 Charmeleon   Fire      64       58     80
7  CharizardMega Charizard X   Fire     130      111    100

In [51]:
#Selecting all the rows and a some columns
now = pokemon_df.iloc [:, [1, 2]]
now.head(5)

  Type 1  Attack
0  Grass      49
1  Grass      62
2  Grass      82
3  Grass     100
4   Fire      52



---

                                                        6. AGGREGATION FUNCTION IN DATA FRAME

Pandas provides some aggregate functions to do some operations on grouped dataframe. Some commonly used aggregation functions are

1) mean()

In [52]:
#Pandas groupby: mean()
#The aggregate function mean() computes mean values for each group. Here, pandas groupby followed by mean will compute mean population for each continent.
path='https://raw.githubusercontent.com/shruthi-jay/pandas/main/Pokemon.csv'
pokemon_df = pd.read_csv(path,sep = ',', header = 'infer', index_col =None, usecols = ['Name','Type 1','Attack','Defense','Speed'])
pokemon_df.groupby("Speed").mean().head(3)

          Attack     Defense
Speed
5      47.500000  135.000000
10     76.666667   77.000000
15     47.777778   53.666667

2) sum()


The aggregating function sum() simply adds of values within each group.

In [53]:
pokemon_df.groupby("Type 1").sum().head(3)

        Attack  Defense  Speed
Type 1
Bug       4897     4880   4256
Dark      2740     2177   2361
Dragon    3588     2764   2657

3) size

The aggregating function size() computes the size per each group.

In [56]:
pokemon_df.groupby("Type 1").size()

Type 1
Bug          69
Dark         31
Dragon       32
Electric     44
Fairy        17
Fighting     27
Fire         52
Flying        4
Ghost        32
Grass        70
Ground       32
Ice          24
Normal       98
Poison       28
Psychic      57
Rock         44
Steel        27
Water       112
dtype: int64

4) count()

The aggregating function count() computes the number of values with in each group.

In [57]:
pokemon_df.groupby("Type 1").count()

          Name  Attack  Defense  Speed
Type 1
Bug         69      69       69     69
Dark        31      31       31     31
Dragon      32      32       32     32
Electric    44      44       44     44
Fairy       17      17       17     17
Fighting    27      27       27     27
Fire        52      52       52     52
Flying       4       4        4      4
Ghost       32      32       32     32
Grass       70      70       70     70
Ground      32      32       32     32
Ice         24      24       24     24
Normal      98      98       98     98
Poison      28      28       28     28
Psychic     57      57       57     57
Rock        44      44       44     44
Steel       27      27       27     27
Water      112     112      112    112

5) std()

The aggregating function std() computes standard deviation of the values within each group.

In [58]:
pokemon_df.groupby("Type 1").std()

             Attack    Defense      Speed
Type 1
Bug       37.040904  33.617609  33.227599
Dark      25.774247  25.121982  27.768203
Dragon    33.742622  24.102938  23.239961
Electric  23.764169  24.757033  26.691607
Fairy     29.751298  18.979478  23.305200
Fighting  28.290163  18.578163  26.054567
Fire      28.769275  23.658200  25.245783
Flying    37.500000  21.360009  32.098806
Ghost     29.629687  32.551138  28.020280
Grass     25.380520  24.485192  28.506456
Ground    33.059087  33.786912  27.450083
Ice       27.289511  34.387708  24.498410
Normal    30.295862  23.771833  28.406157
Poison    19.630010  21.066128  22.631392
Psychic   42.309265  28.359401  37.335412
Rock      35.325458  36.447209  29.903580
Steel     30.388276  44.806548  25.846578
Water     28.377192  27.773809  23.019353

6) var()

The aggregating function var() computes variance, an estimate of variability, for each column per group.

In [59]:
pokemon_df.groupby("Type 1").var()

               Attack      Defense        Speed
Type 1
Bug       1372.028559  1130.143649  1104.073316
Dark       664.311828   631.113978   771.073118
Dragon    1138.564516   580.951613   540.095766
Electric   564.735729   612.910677   712.441860
Fairy      885.139706   360.220588   543.132353
Fighting   800.333333   345.148148   678.840456
Fire       827.671192   559.710407   637.349548
Flying    1406.250000   456.250000  1030.333333
Ghost      877.918347  1059.576613   785.136089
Grass      644.170807   599.524638   812.618012
Ground    1092.903226  1141.555444   753.507056
Ice        744.717391  1182.514493   600.172101
Normal     917.839259   565.100042   806.909741
Poison     385.337302   443.781746   512.179894
Psychic   1790.073935   804.255639  1393.932957
Rock      1247.887949  1328.399049   894.224101
Steel      923.447293  2007.626781   668.045584
Water      805.265042   771.384492   529.890605

7) describe()

The aggregating function describe() computes a quick summary of values per group. It computes the number of values, mean, std, the minimum value, maximum value and value at multiple percentiles.

In [60]:
pokemon_df.groupby("Type 1").describe()

         Attack                               ...  Speed
          count        mean        std   min  ...    25%    50%     75%    max
Type 1                                        ...
Bug        69.0   70.971014  37.040904  10.0  ...  36.00   60.0   85.00  160.0
Dark       31.0   88.387097  25.774247  50.0  ...  59.00   70.0   98.50  125.0
Dragon     32.0  112.125000  33.742622  50.0  ...  65.25   90.0   97.75  120.0
Electric   44.0   69.090909  23.764169  30.0  ...  60.00   88.0  101.50  140.0
Fairy      17.0   61.529412  29.751298  20.0  ...  30.00   45.0   60.00   99.0
Fighting   27.0   96.777778  28.290163  35.0  ...  45.00   60.0   86.00  118.0
Fire       52.0   84.769231  28.769275  30.0  ...  60.00   78.5   96.25  126.0
Flying      4.0   78.750000  37.500000  30.0  ...  97.00  116.0  121.50  123.0
Ghost      32.0   73.781250  29.629687  30.0  ...  44.00   60.5   84.25  130.0
Grass      70.0   73.214286  25.380520  27.0  ...  40.00   58.5   80.00  145.0
Ground     32.0   95.750000  33.059087  40.0  ...  40.00   65.0   90.00  120.0
Ice        24.0   72.750000  27.289511  30.0  ...  48.75   62.0   80.00  110.0
Normal     98.0   73.469388  30.295862   5.0  ...  50.00   71.0   90.75  135.0
Poison     28.0   74.678571  19.630010  43.0  ...  50.00   62.5   77.00  130.0
Psychic    57.0   71.456140  42.309265  20.0  ...  50.00   80.0  104.00  180.0
Rock       44.0   92.863636  35.325458  40.0  ...  35.00   50.0   70.00  150.0
Steel      27.0   92.703704  30.388276  24.0  ...  31.50   50.0   70.00  110.0
Water     112.0   74.151786  28.377192  10.0  ...  50.00   65.0   82.00  122.0

[18 rows x 24 columns]

8) groupby :n()

The aggregating function nth(), gives nth value, in each group.

In [61]:
pokemon_df.groupby("Type 1").nth(10)

                       Name  Attack  Defense  Speed
Type 1
Bug                Venomoth      65       60     90
Dark                  Absol     130       60     75
Dragon    LatiasMega Latias     100      120    110
Electric             Mareep      40       40     35
Fairy               Florges      65       68     75
Fighting           Hariyama     120       60     50
Fire               Rapidash     100       70    105
Ghost              Drifloon      50       34     70
Grass             Exeggcute      40       80     40
Ground              Donphan     120      120     50
Ice                  Sealeo      60       70     45
Normal               Meowth      45       35     90
Poison               Grimer      80       50     25
Psychic                 Mew     100      100    100
Rock              Sudowoodo     100      115     30
Steel                Metang      75      100     50
Water            Tentacruel      70       65    100

9) min() and max()

min() and max() function are used to get minimum and maximum value per group respectively.

In [62]:
pokemon_df.groupby("Type 1").min().head(3)

            Name  Attack  Defense  Speed
Type 1
Bug     Accelgor      10       30      5
Dark       Absol      50       30     20
Dragon   Altaria      50       35     40

In [63]:
pokemon_df.groupby("Type 1").max().head(2)

            Name  Attack  Defense  Speed
Type 1
Bug      Yanmega     185      230    160
Dark    Zweilous     150      125    125



---

                                                     7. Appending rows and columns to the Data frame

dataframe.append() function is used to append rows of other dataframe to the end of the given dataframe, returning a new dataframe object. Columns not in the original dataframes are added as new columns and the new cells are populated with NaN value.

    1) appending one dataframe to another

In [64]:
# Creating the first Dataframe using dictionary
df1 = pd.DataFrame({"movie":[ 'Inception', 'Avengers: Infinity War','Back to the Future','Spider-Man: Into the Spider-Verse'],
                         "year":[2010,2018,1985, 2018]})
# Creating the Second Dataframe using dictionary
df2 = pd.DataFrame({"movie":[ 'Like Stars on Earth','A Silent Voice','Bill Burr: Im Sorry You Feel That Way','The Pianist' ],
                    "year":[2007,2016,2014,2002]})
## to append df2 at the end of df1 dataframe
df1.append(df2)
df1

                               movie  year
0                          Inception  2010
1             Avengers: Infinity War  2018
2                 Back to the Future  1985
3  Spider-Man: Into the Spider-Verse  2018

    2) appending one dataframe to another with index value ignored

In [65]:
df1.append(df2, ignore_index = True)
df1

                               movie  year
0                          Inception  2010
1             Avengers: Infinity War  2018
2                 Back to the Future  1985
3  Spider-Man: Into the Spider-Verse  2018

    3) Append dataframe of different shape

In [66]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
   'type':['Grass','Water','Fire','Bug','Electric']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Lapras', 'Magmar', 'Arbok', 'Beedrill', 'Raichu']})
left.append(right, ignore_index = True)
# the new cells are populated with NaN values.

   id       Name      type
0   1  Bulbasaur     Grass
1   2  Wartortle     Water
2   3    Flareon      Fire
3   4     Kakuna       Bug
4   5    Pikachu  Electric
5   1     Lapras       NaN
6   2     Magmar       NaN
7   3      Arbok       NaN
8   4   Beedrill       NaN
9   5     Raichu       NaN

    3) Add a single row using DataFrame.loc

In [67]:
import pandas as pd
from numpy.random import randint
dict = {'Name': ['Bulbasaur', 'Wartortle', 'Flareon', 'Kakuna', 'Pikachu'],
        'type':['Grass','Water','Fire','Bug','Electric']
       }
df = pd.DataFrame(dict)
df.loc[len(df.index)] = ['Ratatta','Grass'] 
display(df)

        Name      type
0  Bulbasaur     Grass
1  Wartortle     Water
2    Flareon      Fire
3     Kakuna       Bug
4    Pikachu  Electric
5    Ratatta     Grass

    4) Adding new column to existing DataFrame  by declaring a new list as a column

In [68]:
# Import pandas package 
import pandas as pd
# Define a dictionary containing Students data
movi= {'Name': ['Snow White and the Seven Dwarfs', 'Pinocchio', 'Cinderella', 'Born Yesterday'],
        'Year': [1937,1940,1950,1993]}
# Convert the dictionary into DataFrame
df = pd.DataFrame(movi)
# Declare a list that is to be converted into a column
Genre = ['Musical', 'Adventure', 'Drama', 'Romantic Comedy']
# Using 'Address' as the column name and equating it to the list
df['Genre'] = Genre
df

                              Name  Year            Genre
0  Snow White and the Seven Dwarfs  1937          Musical
1                        Pinocchio  1940        Adventure
2                       Cinderella  1950            Drama
3                   Born Yesterday  1993  Romantic Comedy

    5) Adding new column to existing DataFrame using DataFrame.insert()

It gives the freedom to add a column at any position we like and not just at the end. It also provides different options for inserting the column values.

In [69]:
df.insert(2, "Rating", ['G','G','G','PG'], True)
df

                              Name  Year Rating            Genre
0  Snow White and the Seven Dwarfs  1937      G          Musical
1                        Pinocchio  1940      G        Adventure
2                       Cinderella  1950      G            Drama
3                   Born Yesterday  1993     PG  Romantic Comedy

    6)  Adding new column to existing DataFrame using  Dataframe.assign() method

This method will create a new dataframe with new column added to the old dataframe.

In [70]:
import pandas as pd
movie= {'Name': ['Snow White and the Seven Dwarfs', 'Pinocchio', 'Cinderella', 'Born Yesterday'],
        'Year': [1937,1940,1950,1993]}  
df = pd.DataFrame(movie)
# Using 'Genre' as the column name and equating it to the list
df2 = df.assign(Genre = ['Musical', 'Adventure', 'Drama', 'Romantic Comedy'])
   
# Observe the result
df2

                              Name  Year            Genre
0  Snow White and the Seven Dwarfs  1937          Musical
1                        Pinocchio  1940        Adventure
2                       Cinderella  1950            Drama
3                   Born Yesterday  1993  Romantic Comedy

     7) Adding new column to existing DataFrame using Dictionary

We can use a Python dictionary to add a new column in pandas DataFrame. Use an existing column as the key values and their respective values will be the values for new column.

In [71]:
import pandas as pd
data1 = {'Name': ['Hulk', 'Black Widow', 'Wanda', 'Vision']}
# Define a dictionary with key values of an existing column and their respective value pairs as the # values for our new column.
# Convert the dictionary into DataFrame
actor= {'Mark Ruffalo': 'Hulk', 'Scarlett Johansson': 'Black Widow','Elizabeth Olsen':'Wanda', 'Paul Bettany':'Vision'} 
df = pd.DataFrame(data1)
df['actor'] =actor
df

          Name               actor
0         Hulk        Mark Ruffalo
1  Black Widow  Scarlett Johansson
2        Wanda     Elizabeth Olsen
3       Vision        Paul Bettany



---

                                                       8. Pivoting operations with Data Frame

The pivot() function is used to reshaped a given DataFrame organized by given index / column values.

 1) pivot()

In [73]:
pokemon_df.pivot(index ='Name',columns = 'Type 1',values = 'Speed' ).head(5)

Type 1                   Bug   Dark  Dragon  ...  Rock  Steel  Water
Name                                         ...
Abomasnow                NaN    NaN     NaN  ...   NaN    NaN    NaN
AbomasnowMega Abomasnow  NaN    NaN     NaN  ...   NaN    NaN    NaN
Abra                     NaN    NaN     NaN  ...   NaN    NaN    NaN
Absol                    NaN   75.0     NaN  ...   NaN    NaN    NaN
AbsolMega Absol          NaN  115.0     NaN  ...   NaN    NaN    NaN

[5 rows x 18 columns]

2) pivot_table()

It Creates a spreadsheet-style pivot table as a DataFrame.
The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result DataFrame.

In [72]:

df2 = pd.pivot_table(data = pokemon_df,index = 'Name',columns = 'Type 1',values ='Speed')
df2.sample()

Type 1     Bug  Dark  Dragon  Electric  ...  Psychic  Rock  Steel  Water
Name                                    ...
Azumarill  NaN   NaN     NaN       NaN  ...      NaN   NaN    NaN   50.0

[1 rows x 18 columns]

                                                       9.Different possible operations to a Data Frame

some more methods which are useful for dataframe operations  are

1)  Slicing of rows

We can perform slicing operations to get the desired number of rows from within a given range.
With the help of slicing, we can perform various operations only on the specific subset of the data

In [74]:
# slicing the number of rows 
df1 = pokemon_df[10:15]
df1

                       Name Type 1  Attack  Defense  Speed
10                Wartortle  Water      63       80     58
11                Blastoise  Water      83      100     78
12  BlastoiseMega Blastoise  Water     103      120     78
13                 Caterpie    Bug      30       35     45
14                  Metapod    Bug      20       55     30

2) Selecting specific columns

To select a particular column or to select number of columns from the dataframe for further processing of data.

In [75]:
df2 = pokemon_df.loc[:, ['Name','Type 1']]
df2.head(5)

                    Name Type 1
0              Bulbasaur  Grass
1                Ivysaur  Grass
2               Venusaur  Grass
3  VenusaurMega Venusaur  Grass
4             Charmander   Fire

3) Summarize the data

In order to get insights from data, we must have a statistical summary of data. To display a statistical summary of the data such as mean, median, mode, std etc.

In [76]:
pokemon_df.describe()

           Attack     Defense       Speed
count  800.000000  800.000000  800.000000
mean    79.001250   73.842500   68.277500
std     32.457366   31.183501   29.060474
min      5.000000    5.000000    5.000000
25%     55.000000   50.000000   45.000000
50%     75.000000   70.000000   65.000000
75%    100.000000   90.000000   90.000000
max    190.000000  230.000000  180.000000

4) Sort data with respect to a column

In [77]:
pokemon_df.sort_values(by ='Speed').head()

          Name  Type 1  Attack  Defense  Speed
495   Munchlax  Normal      85       40      5
230    Shuckle     Bug      10      230      5
658  Ferroseed   Grass      50       91     10
486     Bonsly    Rock      80       95     10
359   Trapinch  Ground     100       45     10

5) Display mean of each column

In [78]:
pokemon_df.mean()

Attack     79.00125
Defense    73.84250
Speed      68.27750
dtype: float64

6) transpose( ) to to convert dataframe's index to column and columns to index

In [79]:
df.transpose()

                  0                   1                2             3
Name           Hulk         Black Widow            Wanda        Vision
actor  Mark Ruffalo  Scarlett Johansson  Elizabeth Olsen  Paul Bettany



---

                                                         10. String Manipulations.

String manipulation is the process of changing, parsing, splicing, pasting, or analyzing strings

In [80]:
# python script for create a dataframe for string manipulations
import pandas as pd
import numpy as np
  
df = pd.Series(['A Far Off Place', ' Bound by Honor', ' The Three Musketeers','Cabin Boy'])
df

0          A Far Off Place
1           Bound by Honor
2     The Three Musketeers
3                Cabin Boy
dtype: object

1) lower()

 Converts all uppercase characters in strings in the DataFrame to lower case and returns the lowercase strings in the result.

In [83]:
df.str.lower()

0          a far off place
1           bound by honor
2     the three musketeers
3                cabin boy
dtype: object

2) upper()

Converts all lowercase characters in strings in the DataFrame to upper case and returns the uppercase strings in result.

In [84]:
df.str.upper()

0          A FAR OFF PLACE
1           BOUND BY HONOR
2     THE THREE MUSKETEERS
3                CABIN BOY
dtype: object

3) strip()

If there are spaces at the beginning or end of a string, we should trim the strings to eliminate spaces using strip() or remove the extra spaces contained by a string in DataFrame

In [85]:
df
print('\nAfter using the strip:')
df.str.strip()

After using the strip:

0         A Far Off Place
1          Bound by Honor
2    The Three Musketeers
3               Cabin Boy
dtype: object

4) split( )

Splits each string with the given pattern. Strings are split and the new elements after the performed split operation, are stored in a list.

In [87]:
# split(pattern)
print(df)
print('\nAfter using the strip:')
print(df.str.split(','))
  
# now we can use [] or get() to fetch 
# the index values
print('\nusing []:')
print(df.str.split(',').str[0])
  
print('\nusing get():')
print(df.str.split(',').str.get(1))

0          A Far Off Place
1           Bound by Honor
2     The Three Musketeers
3                Cabin Boy
dtype: object

After using the strip:
0          [A Far Off Place]
1          [ Bound by Honor]
2    [ The Three Musketeers]
3                [Cabin Boy]
dtype: object

using []:
0          A Far Off Place
1           Bound by Honor
2     The Three Musketeers
3                Cabin Boy
dtype: object

using get():
0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

5) len()

With the help of len() we can compute the length of each string in DataFrame & if there is empty data in DataFrame, it returns NaN.

In [88]:
print("length of the dataframe: ", len(df))
print("length of each value of dataframe:")
df.str.len()

length of the dataframe:  4
length of each value of dataframe:

0    15
1    15
2    21
3     9
dtype: int64

6) cat(sep= )

 It concatenates the data-frame index elements or each string in DataFrame with given separator.

In [89]:
print(df)
  
print("\nafter using cat:")
print(df.str.cat(sep='_'))
  
print("\nworking with NaN using cat:")
print(df.str.cat(sep='_', na_rep='#'))

0          A Far Off Place
1           Bound by Honor
2     The Three Musketeers
3                Cabin Boy
dtype: object

after using cat:
A Far Off Place_ Bound by Honor_ The Three Musketeers_Cabin Boy

working with NaN using cat:
A Far Off Place_ Bound by Honor_ The Three Musketeers_Cabin Boy

7) repeat(value)

It repeats each element with a given number of times like below in example, there are two appearances of each string in DataFrame.

In [90]:
df.str.repeat(2)

0                A Far Off PlaceA Far Off Place
1                 Bound by Honor Bound by Honor
2     The Three Musketeers The Three Musketeers
3                            Cabin BoyCabin Boy
dtype: object

8) count(pattern)

It returns the count of the appearance of pattern in each element in Data-Frame like below in example it counts n in each string of DataFrame and returns the total counts of n in each string.

In [91]:
print(df.str.count('o'))

0    0
1    3
2    0
3    1
dtype: int64

9) isupper() and isnumeric()

isupper() checks whether all characters in each string in the Index of the Data-Frame in upper case or not, and returns a Boolean value.isnumeric() checks whether all characters in each string in the Index of the Data-Frame are numeric or not, and returns a Boolean value.

In [93]:
print(df.str.isupper()) 
print("\n-----------\n")
print(df.str.isnumeric())

0    False
1    False
2    False
3    False
dtype: bool

-----------

0    False
1    False
2    False
3    False
dtype: bool

It swaps the case lower to upper and vice-versa

In [92]:
df.str.swapcase()

0          a fAR oFF pLACE
1           bOUND BY hONOR
2     tHE tHREE mUSKETEERS
3                cABIN bOY
dtype: object

10) find(pattern) and findall(pattern)

find(pattern)returns first position of the first occurrence of the pattern.findall(pattern) returns a list of all occurrences of the pattern

In [94]:
# find(pattern) in result '-1' indicates there is no value matching with given pattern in particular row
print(df.str.find('n'))
print("\n-----------\n")
# findall(pattern) in result [] indicates null list as  there is no value matching with given pattern in particular row
print(df.str.findall('n'))

0   -1
1    4
2   -1
3    4
dtype: int64

-----------

0        []
1    [n, n]
2        []
3       [n]
dtype: object



---



---



---